In [2]:
!pip install pandas
import pandas as pd

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandas in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\xnovaq.17\documents\newenvironment\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [23]:
s = pd.Series ([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s = pd.Series ([10,20,30,40,50,'abc']) #string
s

0     10
1     20
2     30
3     40
4     50
5    abc
dtype: object

In [6]:
s.dtype

dtype('int64')

In [7]:
s.values

array([10, 20, 30, 40, 50])

In [8]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
t = (['Welcome','to','python'])
df = pd.DataFrame(t)
print(df)

         0
0  Welcome
1       to
2   python

In [ ]:
Data = {'Name':['Angel','Sri','lily'],
        'Age':[20,20,23],
        'Address':['Delhi','Coimbatore','Chennai']}

In [18]:
s.name = "calories"
s

0     10
1     20
2     30
3     40
4     50
5    abc
Name: calories, dtype: object

In [6]:
#Indexing

s[0]

10

In [8]:
s[0:2] #Start(included) Stop(excluded) step(values to jump)

0    10
1    20
Name: numbers, dtype: object

In [9]:
s[2:4]

2    30
3    40
Name: numbers, dtype: object

In [10]:
#iloc Location based indexing

s.iloc[3]

40

In [14]:
s.iloc[[1,3,4]] #multiple values

1    20
3    40
4    50
Name: numbers, dtype: object

In [19]:
index = ["apple","mango","banana","grapes","blueberry"]

In [21]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [24]:
s.index = index
s

apple        10
mango        20
banana       30
grapes       40
blueberry    50
dtype: int64

In [25]:
s.name = "calories"
s

apple        10
mango        20
banana       30
grapes       40
blueberry    50
Name: calories, dtype: int64

In [26]:
s['grapes']

np.int64(40)

In [29]:
#loc : label based indexing #in this  start & end values both are included in output

s.loc['grapes']

np.int64(40)

In [32]:
s.loc[['grapes','mango']] #Multiple

grapes    40
mango     20
Name: calories, dtype: int64

In [30]:
s.loc['mango':'grapes']

mango     20
banana    30
grapes    40
Name: calories, dtype: int64

In [33]:
#dict
fruit_protein = {
    "Avocado": 2.0,      # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [36]:
s2 = pd.Series(fruit_protein,name = "Protein")
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [38]:
#Conditional Selection

s2>1   #Greater than 1

Avocado          True
Guava            True
Blackberries     True
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
Name: Protein, dtype: bool

In [39]:
s2[s2>1]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [40]:
#Logical Operators : AND,OR,NOT

[(s2>0.5) & (s2<2)]

[Avocado         False
 Guava           False
 Blackberries    False
 Oranges          True
 Banana           True
 Apples          False
 Kiwi             True
 Pomegranate      True
 Mango            True
 Cherries         True
 Name: Protein, dtype: bool]

In [44]:
s2[(s2>0.5) & (s2<=2)]

Avocado         2.0
Blackberries    2.0
Oranges         0.9
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [48]:
s2[(s2>0.5) | (s2<=2)]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [49]:
#NOT
s2[~(s2>1)]

Oranges     0.9
Apples      0.3
Mango       0.8
Cherries    1.0
Name: Protein, dtype: float64

In [4]:
import os
os.getcwd()

'C:\\Users\\XNovaQ.17\\Documents'

In [18]:
import os
os.listdir()

[' Task 5 Day .ipynb',
 '.ipynb_checkpoints',
 '3.Sum of Digits using While loop.ipynb',
 '6 oct fulltask.ipynb',
 'app.log',
 'Common Task 1.ipynb',
 'CSV library.ipynb',
 'Customers.sql',
 'customer_info_sample.csv',
 'Data structure.ipynb',
 'Data.ipynb',
 'Decorators.ipynb',
 'demo.txt',
 'desktop.ini',
 'employee.sql',
 'Encapsulation.ipynb',
 'example.csv',
 'fruit.txt',
 'function.ipynb',
 'jupyter',
 'KingsoftData',
 'log',
 'math library.ipynb',
 'meow.txt',
 'My Music',
 'My Pictures',
 'My Videos',
 'newenvironment',
 'new_customers_info.csv',
 'new_customer_info.csv',
 'Numpy.ipynb',
 'Pandas.ipynb',
 'python',
 'Python assessment.ipynb',
 're library.ipynb',
 'SCHOOL.sql',
 'stud',
 'student department marks.sql',
 'student.sql',
 'summary.txt',
 'Task 10.ipynb',
 'Task 11.ipynb',
 'Task 12 File handling.ipynb',
 'Task 13.ipynb',
 'Task 14.ipynb',
 'Task 3 value error.ipynb',
 'Task 6.ipynb',
 'Task 7.ipynb',
 'Task 8 Class .ipynb',
 'Task 9.ipynb',
 'Task Workout 2.ipynb',
 'Task workout 3.ipynb',
 'Task workout 4.ipynb',
 'Task workout 5.ipynb',
 'Task workout 6.ipynb',
 'Task Workout-1.ipynb',
 'Teacher.sql',
 'try except.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'workout12.ipynb']

In [15]:
df = pd.read_csv("customer_info_sample.csv") #import
df

   customer_id   customer_name       city       phone                 email
0            1        John Doe   New York  9876543210      john@example.com
1            2     Emma Watson    Chicago  9123456780      emma@example.com
2            3      Liam Brown     Boston  9988776655      liam@example.com
3            4    Olivia Smith     Dallas  9090909090    olivia@example.com
4            5  Sophia Johnson      Miami  9876501234    sophia@example.com
5            6      Noah Davis    Seattle  9123409876      noah@example.com
6            7      Ava Wilson     Denver  9001122334       ava@example.com
7            8   Elijah Miller    Houston  9898989898    elijah@example.com
8            9  Isabella Moore    Atlanta  9112233445  isabella@example.com
9           10    James Taylor  San Diego  9445566778     james@example.com

In [17]:
df.to_csv("new_customers_info.csv", index=False) #export

In [21]:
df.head() #1st few rows

   customer_id   customer_name      city       phone               email
0            1        John Doe  New York  9876543210    john@example.com
1            2     Emma Watson   Chicago  9123456780    emma@example.com
2            3      Liam Brown    Boston  9988776655    liam@example.com
3            4    Olivia Smith    Dallas  9090909090  olivia@example.com
4            5  Sophia Johnson     Miami  9876501234  sophia@example.com

In [22]:
df.tail() #last few rows

   customer_id   customer_name       city       phone                 email
5            6      Noah Davis    Seattle  9123409876      noah@example.com
6            7      Ava Wilson     Denver  9001122334       ava@example.com
7            8   Elijah Miller    Houston  9898989898    elijah@example.com
8            9  Isabella Moore    Atlanta  9112233445  isabella@example.com
9           10    James Taylor  San Diego  9445566778     james@example.com

In [23]:
df.shape #Check rows & columns count

(10, 5)

In [24]:
df["customer_name"] #show only one column

0          John Doe
1       Emma Watson
2        Liam Brown
3      Olivia Smith
4    Sophia Johnson
5        Noah Davis
6        Ava Wilson
7     Elijah Miller
8    Isabella Moore
9      James Taylor
Name: customer_name, dtype: object

In [25]:
df[["customer_name", "city"]] #Show multiple columns

    customer_name       city
0        John Doe   New York
1     Emma Watson    Chicago
2      Liam Brown     Boston
3    Olivia Smith     Dallas
4  Sophia Johnson      Miami
5      Noah Davis    Seattle
6      Ava Wilson     Denver
7   Elijah Miller    Houston
8  Isabella Moore    Atlanta
9    James Taylor  San Diego

In [26]:
df[df["city"] == "Miami"] #Filter customers city

   customer_id   customer_name   city       phone               email
4            5  Sophia Johnson  Miami  9876501234  sophia@example.com

In [27]:
df.sort_values("customer_name") #Sort by name

   customer_id   customer_name       city       phone                 email
6            7      Ava Wilson     Denver  9001122334       ava@example.com
7            8   Elijah Miller    Houston  9898989898    elijah@example.com
1            2     Emma Watson    Chicago  9123456780      emma@example.com
8            9  Isabella Moore    Atlanta  9112233445  isabella@example.com
9           10    James Taylor  San Diego  9445566778     james@example.com
0            1        John Doe   New York  9876543210      john@example.com
2            3      Liam Brown     Boston  9988776655      liam@example.com
5            6      Noah Davis    Seattle  9123409876      noah@example.com
3            4    Olivia Smith     Dallas  9090909090    olivia@example.com
4            5  Sophia Johnson      Miami  9876501234    sophia@example.com

In [28]:
df["country"] = "USA" #Add a new column
df

,customer_id,customer_name,city,phone,email,country
0,1,John Doe,New York,9876543210,john@example.com,USA
1,2,Emma Watson,Chicago,9123456780,emma@example.com,USA
2,3,Liam Brown,Boston,9988776655,liam@example.com,USA
3,4,Olivia Smith,Dallas,9090909090,olivia@example.com,USA
4,5,Sophia Johnson,Miami,9876501234,sophia@example.com,USA
5,6,Noah Davis,Seattle,9123409876,noah@example.com,USA
6,7,Ava Wilson,Denver,9001122334,ava@example.com,USA
7,8,Elijah Miller,Houston,9898989898,elijah@example.com,USA
8,9,Isabella Moore,Atlanta,9112233445,isabella@example.com,USA
9,10,James Taylor,San Diego,9445566778,james@example.com,USA

In [31]:
df.loc[df["customer_id"] == 1, "city"] = "Los Angeles" #Update a value
print(df)

   customer_id   customer_name         city       phone                 email  \
0            1        John Doe  Los Angeles  9876543210      john@example.com
1            2     Emma Watson      Chicago  9123456780      emma@example.com
2            3      Liam Brown       Boston  9988776655      liam@example.com
3            4    Olivia Smith       Dallas  9090909090    olivia@example.com
4            5  Sophia Johnson        Miami  9876501234    sophia@example.com
5            6      Noah Davis      Seattle  9123409876      noah@example.com
6            7      Ava Wilson       Denver  9001122334       ava@example.com
7            8   Elijah Miller      Houston  9898989898    elijah@example.com
8            9  Isabella Moore      Atlanta  9112233445  isabella@example.com
9           10    James Taylor    San Diego  9445566778     james@example.com

  country
0     USA
1     USA
2     USA
3     USA
4     USA
5     USA
6     USA
7     USA
8     USA
9     USA

In [32]:
df.drop("email", axis=1, inplace=True) #Delete a column

In [33]:
print(df)

   customer_id   customer_name         city       phone country
0            1        John Doe  Los Angeles  9876543210     USA
1            2     Emma Watson      Chicago  9123456780     USA
2            3      Liam Brown       Boston  9988776655     USA
3            4    Olivia Smith       Dallas  9090909090     USA
4            5  Sophia Johnson        Miami  9876501234     USA
5            6      Noah Davis      Seattle  9123409876     USA
6            7      Ava Wilson       Denver  9001122334     USA
7            8   Elijah Miller      Houston  9898989898     USA
8            9  Isabella Moore      Atlanta  9112233445     USA
9           10    James Taylor    San Diego  9445566778     USA

In [34]:
df.to_csv("updated_customer_info.csv", index=False) #Save the modified file